#2. Написати скрипт, який пройдеться по списку, який складається із кортежів, і замінить для кожного кортежа останнє значення. 
#Список із кортежів можна захардкодити. Значення, на яке замінюється останній елемент кортежа вводиться користувачем.
#Значення, введене користувачем, можна ніяк не конвертувати (залишити рядком). Кількість елементів в кортежу повинна бути різна.
last_number = str(input("Enter number: "))
list_in_dict = [(10, 11, 13), (12, 14, 16), (18, 20, 25, 30), (31, 33), (100, )]
print ([random_number[:-1] + (last_number,) for random_number in list_in_dict])
